Revit 2027 API
ParameterTypeId.StairsRunBeginWithRiser Property
 "Begin with Riser": Begin with Riser
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunBeginWithRiser { get; }
Public Shared ReadOnly Property StairsRunBeginWithRiser As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunBeginWithRiser {
	ForgeTypeId^ get ();
}
static member StairsRunBeginWithRiser : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace